ua1arn/hftrx/lib/stm32mp1/usbx/Src/usbd_conf.c
		const int nuacinpackets = 1 * mul2;
		const uint_fast16_t uacinmaxpacket = usbd_getuacinrtsmaxpacket();

		const uint_fast16_t size4 = nuacinpackets * (size2buff4(uacinmaxpacket) + add3tx);
		ASSERT(last4 >= size4);
		last4 -= size4;
		USBx->DIEPTXF [pipe - 1] = usbd_makeTXFSIZ(last4, size4);
		//PRINTF(PSTR("usbd_fifo_initialize3 - UAC3 %u bytes: 4*(full4-last4)=%u\n"), 4 * size4, 4 * (full4 - last4));
	}
#endif /* WITHUSBUACIN2 */
#endif /* WITHUSBUACIN */
#if WITHUSBUACOUT
	{
		numoutendpoints += 1;
		maxoutpacketsize4 = MAX(maxoutpacketsize4, nuacoutpackets * size2buff4(usbd_getuacoutmaxpacket()));
	}
#endif /* WITHUSBUACOUT */
#endif /* WITHUSBUAC */

#if WITHUSBCDCACM
#if WITHUSBCDCACMINTSHARING
	{
		const uint_fast8_t pipeint = USBD_EP_CDCACM_INTSHARED & 0x7F;
		USBx->DIEPTXF [pipeint - 1] = usbd_makeTXFSIZ(last4dummy, size4dummy);
	}
#endif /* WITHUSBCDCACMINTSHARING */
	for (offset = 0; offset < WITHUSBCDCACM_N; ++ offset)
	{
	#if ! WITHUSBCDCACMINTSHARING
		{
			const uint_fast8_t pipeint =  USBD_CDCACM_EP(USBD_EP_CDCACM_INT, offset) & 0x7F;
			USBx->DIEPTXF [pipeint - 1] = usbd_makeTXFSIZ(last4dummy, size4dummy);
		}
	#endif /* ! WITHUSBCDCACMINTSHARING */
		{
			/* полнофункциональное устройство */
			const uint_fast8_t pipe = USBD_CDCACM_EP(USBD_EP_CDCACM_IN, offset) & 0x7F;
			numoutendpoints += 1;
			if (bigbuff == 0 && offset > 0)
			{
				// на маленьких контроллерах только первый USB CDC может обмениваться данными
				USBx->DIEPTXF [pipe - 1] = usbd_makeTXFSIZ(last4dummy, size4dummy);

			}
			else
			{
				#if WITHUSBUAC
					#if WITHUSBUACIN2
						const int ncdcindatapackets = 1 * mul2, ncdcoutdatapackets = 3;
					#elif WITHRTS96 || WITHRTS192
						const int ncdcindatapackets = 2 * mul2, ncdcoutdatapackets = 3;
					#else /* WITHRTS96 || WITHRTS192 */
						const int ncdcindatapackets = 2 * mul2, ncdcoutdatapackets = 3;
					#endif /* WITHRTS96 || WITHRTS192 */
				#else /* WITHUSBUAC */
					const int ncdcindatapackets = 4, ncdcoutdatapackets = 4;
				#endif /* WITHUSBUAC */

				maxoutpacketsize4 = MAX(maxoutpacketsize4, ncdcoutdatapackets * size2buff4(VIRTUAL_COM_PORT_OUT_DATA_SIZE));


				const uint_fast16_t size4 = ncdcindatapackets * (size2buff4(VIRTUAL_COM_PORT_IN_DATA_SIZE) + add3tx);
				ASSERT(last4 >= size4);
				last4 -= size4;
				USBx->DIEPTXF [pipe - 1] = usbd_makeTXFSIZ(last4, size4);
				//PRINTF(PSTR("usbd_fifo_initialize4 CDC %u bytes: 4*(full4-last4)=%u\n"), 4 * size4, 4 * (full4 - last4));
			}
		}

	}
#endif /* WITHUSBCDCACM */

#if WITHUSBCDCEEM
	{
		/* полнофункциональное устройство */
		const uint_fast8_t pipe = USBD_EP_CDCEEM_IN & 0x7F;

		numoutendpoints += 1;
		const int ncdceemindatapackets = 1 * mul2 + 1, ncdceemoutdatapackets = 3;

		maxoutpacketsize4 = MAX(maxoutpacketsize4, ncdceemoutdatapackets * size2buff4(USBD_CDCEEM_BUFSIZE));


		const uint_fast16_t size4 = ncdceemindatapackets * (size2buff4(USBD_CDCEEM_BUFSIZE) + add3tx);
		ASSERT(last4 >= size4);
		last4 -= size4;
		USBx->DIEPTXF [pipe - 1] = usbd_makeTXFSIZ(last4, size4);
		//PRINTF(PSTR("usbd_fifo_initialize5 EEM %u bytes: 4*(full4-last4)=%u\n"), 4 * size4, 4 * (full4 - last4));
	}
#endif /* WITHUSBCDCEEM */

#if WITHUSBRNDIS
	{
		/* полнофункциональное устройство */
		const uint_fast8_t pipe = (USBD_EP_RNDIS_IN + 0) & 0x7F;
		const uint_fast8_t pipeint = (USBD_EP_RNDIS_INT + 0) & 0x7F;
		numoutendpoints += 1;
		const int
			nrndisindatapackets = 3,
			nrndisintdatapackets = 3,
			nrndisoutdatapackets = 3;

		maxoutpacketsize4 = MAX(maxoutpacketsize4, nrndisoutdatapackets * size2buff4(USBD_RNDIS_OUT_BUFSIZE));


		const uint_fast16_t size4 = nrndisindatapackets * (size2buff4(USBD_RNDIS_IN_BUFSIZE) + add3tx);
		ASSERT(last4 >= size4);
		last4 -= size4;
		USBx->DIEPTXF [pipe - 1] = usbd_makeTXFSIZ(last4, size4);
		const uint_fast16_t size4int = nrndisintdatapackets * (size2buff4(USBD_RNDIS_INT_SIZE) + add3tx);
		ASSERT(last4 >= size4int);
		last4 -= size4int;
		USBx->DIEPTXF [pipeint - 1] = usbd_makeTXFSIZ(last4, size4int);
		//PRINTF(PSTR("usbd_fifo_initialize4 RNDIS %u bytes: 4*(full4-last4)=%u\n"), 4 * size4, 4 * (full4 - last4));
	}

#endif /* WITHUSBRNDIS */

#if WITHUSBHID && 0
	{
		/* ... устройство */
		const uint_fast8_t pipe = USBD_EP_HIDMOUSE_INT & 0x7F;

		const uint_fast16_t size4 = size2buff4(HIDMOUSE_INT_DATA_SIZE);
		ASSERT(last4 >= size4);
		last4 -= size4;
		USBx->DIEPTXF [pipe - 1] = usbd_makeTXFSIZ(last4, size4);
		//PRINTF(PSTR("usbd_fifo_initialize8 HID %u bytes: 4*(full4-last4)=%u\n"), 4 * size4, 4 * (full4 - last4));
	}
#endif /* WITHUSBHID */

	//PRINTF(PSTR("usbd_fifo_initialize9: 4*(full4-last4)=%u\n"), 4 * (full4 - last4));

	/* control endpoint TX FIFO */
	{
		/* Установить размер TX FIFO EP0 */
		const uint_fast16_t size4 = 2 * (size2buff4(USB_OTG_MAX_EP0_SIZE) + add3tx);
		ASSERT(last4 >= size4);
		last4 -= size4;
		USBx->DIEPTXF0_HNPTXFSIZ = usbd_makeTXFSIZ(last4, size4);
		//PRINTF(PSTR("usbd_fifo_initialize10 TX FIFO %u bytes: 4*(full4-last4)=%u\n"), 4 * size4, 4 * (full4 - last4));
	}
	/* control endpoint RX FIFO */
	{
		/* Установить размер RX FIFO -  теперь все что осталоь - используем last4 вместо size4 */
		// (4 * number of control endpoints + 6) +
		// ((largest USB packet used / 4) + 1 for status information) +
		// (2 * number of OUT endpoints) +
		// 1 for Global NAK
		const uint_fast16_t size4 =
				(4 * numcontrolendpoints + 6) +
				(maxoutpacketsize4 + 1) +
				(2 * numoutendpoints) +
				1 +
				addplaces;

		//PRINTF(PSTR("usbd_fifo_initialize11 RX FIFO %u bytes: 4*(full4-last4)=%u bytes (last4=%u, size4=%u)\n"), 4 * size4, 4 * (full4 - last4), last4, size4);
		ASSERT(last4 >= size4);
		USBx->GRXFSIZ = (USBx->GRXFSIZ & ~ USB_OTG_GRXFSIZ_RXFD) |
			(last4 << USB_OTG_GRXFSIZ_RXFD_Pos) |	// was: size4 - то что осталось
			0;
		base4 += size4;
	}

	if (base4 > last4 || last4 > full4)
	{
		char b [64];
		PRINTF(PSTR("usbd_fifo_initialize error: base4=%u, last4=%u, fullsize=%u\n"), (base4 * 4), (last4 * 4), fullsize);
//		local_snprintf_P(b, sizeof b / sizeof b [0], PSTR("used=%u"), (base4 * 4) + (fullsize - last4 * 4));
//		colmain_setcolors(COLORMAIN_RED, BGCOLOR);
//		display_at(0, 0, b);
		for (;;)
			;
	}
	else
	{
		//PRINTF(PSTR("usbd_fifo_initialize: base4=%u, last4=%u, fullsize=%u\n"), (base4 * 4), (last4 * 4), fullsize);
#if 0
		// Диагностическая выдача использованного объёма FIFO RAM
		char b [64];

		local_snprintf_P(b, sizeof b / sizeof b [0], PSTR("used=%u"), (base4 * 4) + (fullsize - last4 * 4));
		colmain_setcolors(COLORMAIN_GREEN, BGCOLOR);
		display_at(0, 0, b);
		HARDWARE_DELAY_MS(2000);
#endif
	}

	(void) USB_FlushRxFifo(USBx);
	(void) USB_FlushTxFifo(USBx, 0x10U); /* all Tx FIFOs */
}

